In [1]:
import pandas as pd

In [65]:
df_carac_2021 = pd.read_csv("../data/caracteristiques_2021.csv", sep=';')
df_lieux_2021 = pd.read_csv("../data/lieux_2021.csv", sep=';')
df_usagers_2021 = pd.read_csv("../data/usagers_2021.csv", sep=';')
df_vehicules_2021 = pd.read_csv("../data/vehicules_2021.csv", sep=';')

In [67]:
df_usagers_2021['id_usager'].isna().sum()

0

In [51]:

df_carac_2021 = df_carac_2021[df_carac_2021['Num_Acc'] == 202100000007]
df_carac_2021.head()

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
6,202100000007,13,12,2021,19:10,5,38,38053,2,9,1,1,REPUBLIQUE (PLACE DE LA),"45,5888000000","5,2730500000"

In [55]:


df_lieux_2021 = df_lieux_2021[df_lieux_2021['Num_Acc'] == 202100000007]


df_lieux_2021.head()

,Num_Acc,catr,voie,v1,v2,circ,nbv,vosp,prof,pr,pr1,plan,lartpc,larrout,surf,infra,situ,vma
6,202100000007,4,REPUBLIQUE (PLACE DE LA),0,NaN,2,0,0,1,0,1,1,NaN,-1,1,5,1,50

In [59]:
df_usagers_2021 = df_usagers_2021[df_usagers_2021['Num_Acc'] == 202100000007]


df_usagers_2021.head()

,Num_Acc,id_usager,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,secu2,secu3,locp,actp,etatp
12,202100000007,267 622,201 750,B01,4,2,4,2,2002.0,0,1,0,-1,-1,-1,-1
13,202100000007,267 623,201 750,B01,1,1,1,1,2001.0,5,1,5,-1,-1,-1,-1
14,202100000007,267 624,201 751,A01,1,1,4,1,1991.0,0,1,5,-1,-1,-1,-1

In [63]:
df_vehicules_2021 = df_vehicules_2021[df_vehicules_2021['Num_Acc'] == 202100000007]

df_vehicules_2021.head()

,Num_Acc,id_vehicule,num_veh,senc,catv,obs,obsm,choc,manv,motor,occutc
11,202100000007,201 750,B01,3,7,0,2,2,11,1,NaN
12,202100000007,201 751,A01,3,7,0,2,2,1,1,NaN